## 문제1
- 데이터셋(basic1.csv)의 'f5' 컬럼을 기준으로 상위 10개의 데이터를 구하고,
- 'f5'컬럼 10개 중 최소값으로 데이터를 대체한 후, 
- 'age'컬럼에서 80 이상인 데이터의'f5 컬럼 평균값 구하기

In [32]:
import pandas as pd
import numpy as np

In [66]:
# 엑셀 파일 읽기
df_raw = pd.read_excel("data/basic1.xlsx", sheet_name='basic1')

# 첫 번째 열을 쉼표 기준으로 분리
df = df_raw.iloc[:, 0].str.split(",", expand=True)

# 컬럼명 설정
df.columns = ['id', 'age', 'city', 'f1', 'f2', 'f3', 'f4', 'f5']

# 타입 변환 (숫자 컬럼)
cols_to_numeric = ['age', 'f1', 'f2', 'f5']
df[cols_to_numeric] = df[cols_to_numeric].apply(pd.to_numeric, errors='coerce')

In [68]:
df1=df.copy()

In [70]:
df_sorted=df1.sort_values(['f5'],ascending=False).reset_index(drop=True)

In [72]:
f5min=df_sorted.head(10)['f5'].min()
df_sorted.loc[:9,'f5']=f5min
result= df_sorted[df_sorted['age']>=80]['f5'].mean()
result

62.49774712521738

## 문제2
- 데이터셋(basic1.csv)의 앞에서 순서대로 70% 데이터만 활용해서,
- 'f1'컬럼 결측치를 중앙값으로 채우기 전후의 표준편차를 구하고
- 두 표준편차 차이 계산하기

In [15]:
# 라이브러리 및 데이터 불러오기
import pandas as pd
import numpy as np

In [76]:
df2=df.copy()

In [79]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      100 non-null    object
 1   age     100 non-null    float64
 2   city    100 non-null    object
 3   f1      69 non-null     float64
 4   f2      100 non-null    int64
 5   f3      100 non-null    object
 6   f4      100 non-null    object
 7   f5      100 non-null    float64
dtypes: float64(3), int64(1), object(4)
memory usage: 6.4+ KB

In [81]:
df2=df2.loc[:69,:]

In [84]:
df2.shape

(70, 8)

In [86]:
df2['f1'].isnull().sum()

23

In [88]:
df2['f1'].describe() # std = 17.987276

count     47.000000
mean      68.744681
std       17.987276
min       34.000000
25%       56.000000
50%       68.000000
75%       83.500000
max      111.000000
Name: f1, dtype: float64

In [94]:
std1= df2['f1'].agg('std')
median=df2['f1'].median()

In [100]:
df2.loc[:,'f1']= df2['f1'].fillna(median)

In [102]:
std2 = df2['f1'].std()

In [106]:
abs(std2-std1)

3.2965018033960725

In [108]:
df2.isnull().sum()

id      0
age     0
city    0
f1      0
f2      0
f3      0
f4      0
f5      0
dtype: int64

## 문제3
- 데이터셋(basic1.csv)의 'age'컬럼의 이상치를 더하시오!
- 단, 평균으로부터 1.5*표준편차를 벗어나는 영역을 이상치라고 판단함

In [110]:
df3=df.copy()

In [112]:
mean=df3['age'].mean()

In [114]:
std=df3['age'].std()

In [118]:
df3[(df3['age']>mean+1.5*std)|(df3['age']<mean-1.5*std)]['age'].sum()

473.5

In [121]:
# 혼자 연습
df4=df.copy()
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      100 non-null    object
 1   age     100 non-null    float64
 2   city    100 non-null    object
 3   f1      69 non-null     float64
 4   f2      100 non-null    int64
 5   f3      100 non-null    object
 6   f4      100 non-null    object
 7   f5      100 non-null    float64
dtypes: float64(3), int64(1), object(4)
memory usage: 6.4+ KB

In [123]:
df4.head(2)

     id  age city    f1  f2 f3    f4         f5
0  id01  2.0   서울   NaN   0     ENFJ  91.297791
1  id02  9.0   서울  70.0   1     ENFJ  60.339826

In [139]:
df4.groupby(['city','f4'])['age'].mean().reset_index().head()

  city    f4        age
0   경기  ENTJ  61.250000
1   경기  ENTP  63.500000
2   경기  ESFJ   1.000000
3   경기  ESFP  48.666667
4   경기  ESTJ  64.000000

In [141]:
df4.groupby(['city','f4'])['age'].mean().head()

city  f4
경기    ENTJ    61.250000
      ENTP    63.500000
      ESFJ     1.000000
      ESFP    48.666667
      ESTJ    64.000000
Name: age, dtype: float64